# StairsWinderpatternNumberOfStraightStepsAtEnd Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsWinderpatternNumberOfStraightStepsAtEnd Property
ParameterTypeId Class See Also
---
"Parallel Treads at End": Number of straight steps at the begin of winder
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsWinderpatternNumberOfStraightStepsAtEnd { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsWinderpatternNumberOfStraightStepsAtEnd As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsWinderpatternNumberOfStraightStepsAtEnd {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace